[
  {
    "id": 29,
    "title": "Evento online, no canal do YouTube",
    "date": "16 de Julho",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Teoria das categorias na prática com as mônadas Either e Maybe/Option",
        "speaker": "Vitor Luiz Cavalcanti",
        "description": "Desenvolvedor Front-End na Linte, Bacharel em Sistemas de Informação pela FIAP, organizador do TypeScript Brasil e mantenedor de mais de 30 bibliotecas open-source.",
        "photo": "victorluiz.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Schematics: estenda os poderes da CLI do Angular",
        "speaker": "Mayara Lopes Cardoso",
        "description": "Engenheira Front-end no Itaú Unibanco, pós-graduada em Desenvolvimento Front-end e coorganizadora da comunidade AngularSP.",
        "photo": "mayaralopes.jpeg"
      },
      {
        "subtitle": "TALK #3",
        "title": "Consumindo uma API GraphQL com Angular",
        "speaker": "Thiago Adriano",
        "description": "Microsoft (MVP), atualmente trabalha como Arquiteto de Software para TV Bandeirantes. Nesses últimos anos, focou nas tecnologias criadas pela Microsoft, mas sempre esteve antenado para as novas tecnologias que estão surgindo no mercado. Em um breve resumo, é uma pessoa apaixonada pelo que faz, tem a sua profissão como hobby.",
        "photo": "thiagoadriano.jpeg"
      }
    ]
  },
  {
    "id": 31,
    "title": "Parceria com Angular Bahia Online",
    "date": "24 de Setembro",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Seus primeiros passos com Angular",
        "speaker": "Michael Oliveira de Deus",
        "description": "Pai, Desenvolvedor de Software e apaixonado pela tecnologia e código, gosto muito jogos online e esportes como luta e puxar ferro.",
        "photo": "michael.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Criando uma aplicação white-label sem *ngIf",
        "speaker": "Igor Debastiani",
        "description": "Sou um desenvolvedor Full-Stack e tenho trabalhado com mais foco em Front-End, especificamente em aplicações mobile híbridas utilizando Ionic Capacitor.",
        "photo": "igor.jpg"
      }
    ]
  },
  {
    "id": 32,
    "title": "Parceria com NodeBR Online",
    "date": "29 de Outubro",
    "primaryColor": "#ba0582",
    "secondaryColor": "#d33479",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "NPM foi longe demais?",
        "speaker": "Filipe Silva",
        "description": "Líder técnico em Engenharia de Software na DellTech, louco por tecnologia, startups e produtos digitais.",
        "photo": "filipe.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Automatizando a publicação de pacotes com Semantic Release",
        "speaker": "Américo Neto",
        "description": "Desenvolvedor web no Itaú Unibanco, pai, santista e coorganizador da comunidade AngularSP.",
        "photo": "americo.jpg"
      }
    ]
  },
  {
    "id": 33,
    "title": "Parceria com  VueSP Online",
    "date": "26 de Novembro",
    "primaryColor": "#3CB371",
    "secondaryColor": "#104E8B",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "WebComponents: Por que utilizar e como construir usando Angular Elements",
        "speaker": "Karine Riquena Limp",
        "description": "Formada em Análise e Desenvolvimento de Sistemas. Iniciou a carreira como programadora backend .NET MVC. Trabalha na TOTVS. Atualmente, programando em ADVPL, .NET Core e Angular.",
        "photo": "karine.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Hello, Mr. Vue! Welcome V3",
        "speaker": "Heitor Ramon (vuejssp)",
        "description": "Engenheiro de Software com 15 anos de experiência, focado em arquitetura e frontend. Escritor do livro Vue.js 3 Cookbook publicado pela Packt. Lead Frontend Engineer na Kovi.",
        "photo": "heitor.jpg"
      }
    ]
  },
  {
    "id": 36,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de Fevereiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Testes Unitários com Jasmine",
        "speaker": "William Gundim",
        "description": "Desenvolvedor há mais de 10 anos. Atualmente, trabalhando com tecnologias web no Itaú Unibanco.",
        "photo": "williamg.JPG"
      },
      {
        "subtitle": "TALK #2",
        "title": "Micro front ends e Ng - Um Pesadelo virando sonho",
        "speaker": "Paulo Marinho",
        "description": "Desenvolvendo para web desde a epoca de BBS, tendo passado pelo por grandes empresas como iGSantander e Cultura como startups como ChefsClub e Plannera.",
        "photo": "tommy.JPG"
      }
    ]
  },
  {
    "id": 37,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de Março",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Simples e Fácil ",
        "speaker": "Guilherme Siquinelli",
        "description": "Desenvolvedor Front-end com mais de 14  anos de experiência, Tech Lead no Itaú. Está sempre avaliando tecnologias e tentando identificar que problemas podem ser resolvidos, misturado à aceitação da comunidade. Acredita que WebRTC tem potência disruptivo pra mudar nosso mercado como o conhecemos",
        "photo": "guilherme.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Vou ter que trabalhar com AngularJS. E agora?",
        "speaker": "Igor Debastiani",
        "description": "É desenvolvedor web front-end e já trabalhou com várias versões do Angular, tanto para web como para aplicações mobile híbridas. Atualmente dá manutenção em sistemas AngularJS e Angular 9.",
        "photo": "igor_debastiani.jpeg"
      }
    ]
  },
  {
    "id": 40,
    "title": "Evento online, no canal do Youtube",
    "date": "24 de Junho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Criando CRUD com PO-UI",
        "speaker": "Jhony Eduardo Senem",
        "description": "Jhony tem 25 anos, mora em Joinville SC, é graduado em Sistemas de Informação pelo Centro Universitário Católica - SC, Atualmente trabalhando na TOTVS como analista front-end, atuando no papel Product Owner do PO UI, possui experiências em Angular JS e Angular.",
        "photo": "Jhony_Senem.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "CSS Clamp",
        "speaker": "Thiago Piacentini",
        "description": "Formado em Análise e Desenvolvimento de Sistemas, atuando como Desenvolvedor Front-end no Itaú, sempre buscando aprender e aplicar responsividade e acessibilidade nas interface.",
        "photo": "Thiago_Piacentini.jpg"
      }
    ]
  },
  {
    "id": 41,
    "title": "Evento online, no canal do Youtube",
    "date": "29 de julho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Angular e Supabase - Uma alternativa ao Firebase",
        "speaker": "Kheron Machado",
        "description": "Professor da educação básica na rede pública estadual do Paraná, atua na formação de professores para uso de tecnologia em sala de aula. É desenvolvedor há mais de 12 anos. Tinha o perfil de Webmaster no Orkut e agora Front-end e Mobile no Linkedin.Formado em Processamento pela Fatec e Mestre em Computação pela UFPR, em 2019 escreveu o livro Angular e Firebase: Construindo uma aplicação integrada com a plataforma do Google pela Casa do Código.",
        "photo": "kheron.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Soft Skill - As habilidades secretas que não te ensinaram",
        "speaker": "Paolo Almeida",
        "description": "Caiçara. 32 anos. Trabalha com Produtos Digitais a mais de 10 anos. Atua como Engenheiro de Software no Itaú. Entusiasta em Open Source. Fã de Carreta Furacão. Finge que dança e surfa nas horas vagas.",
        "photo": "paolo_almeida.jpeg"
      }
    ]
  },
  {
    "id": 42,
    "title": "Evento online, no canal do Youtube",
    "date": "24 de agosto",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Dependency Injection com Angular",
        "speaker": "Guilherme Siquinelli",
        "description": "Engenheiro Front-end no Itaú Unibanco e 15 anos de experiência, estou sempre avaliando tecnologias na tentativa de identificar que problemas podem ser resolvidos, em conjunto à aceitação da comunidade. Em busca do máximo que a Web tem a oferecer!",
        "photo": "guilherme_siquinelli.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Teste unitário e a busca pela cobertura ideal",
        "speaker": "Vinicius Ledesma",
        "description": "Formado em Sistemas de Informação pelo Mackenzie e pós graduado em Engenharia Web/Mobile pelo Senac, trabalha com TI desde 2000. Trabalhou mais de 10 anos com sistema legado onde pode ajudar na evolução da linguagem para acompanhar os padrões de mercado das linguagens modernas. Hoje trabalha com uma linguagem moderna e sabe reconhecer o valor de cada ferramenta na hora de entregar um sistema com qualidade.",
        "photo": "vinicius_ledesma.jpeg"
      }
    ]
  }
]
