[
  {
    "id": 29,
    "title": "Evento online, no canal do YouTube",
    "date": "16 de Julho",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Teoria das categorias na prática com as mônadas Either e Maybe/Option",
        "speaker": "Vitor Luiz Cavalcanti",
        "description": "Desenvolvedor Front-End na Linte, Bacharel em Sistemas de Informação pela FIAP, organizador do TypeScript Brasil e mantenedor de mais de 30 bibliotecas open-source.",
        "photo": "victorluiz.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Schematics: estenda os poderes da CLI do Angular",
        "speaker": "Mayara Lopes Cardoso",
        "description": "Engenheira Front-end no Itaú Unibanco, pós-graduada em Desenvolvimento Front-end e coorganizadora da comunidade AngularSP.",
        "photo": "mayaralopes.jpeg"
      },
      {
        "subtitle": "TALK #3",
        "title": "Consumindo uma API GraphQL com Angular",
        "speaker": "Thiago Adriano",
        "description": "Microsoft (MVP), atualmente trabalha como Arquiteto de Software para TV Bandeirantes. Nesses últimos anos, focou nas tecnologias criadas pela Microsoft, mas sempre esteve antenado para as novas tecnologias que estão surgindo no mercado. Em um breve resumo, é uma pessoa apaixonada pelo que faz, tem a sua profissão como hobby.",
        "photo": "thiagoadriano.jpeg"
      }
    ]
  },
  {
    "id": 31,
    "title": "Parceria com Angular Bahia Online",
    "date": "24 de Setembro",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Seus primeiros passos com Angular",
        "speaker": "Michael Oliveira de Deus",
        "description": "Pai, Desenvolvedor de Software e apaixonado pela tecnologia e código, gosto muito jogos online e esportes como luta e puxar ferro.",
        "photo": "michael.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Criando uma aplicação white-label sem *ngIf",
        "speaker": "Igor Debastiani",
        "description": "Sou um desenvolvedor Full-Stack e tenho trabalhado com mais foco em Front-End, especificamente em aplicações mobile híbridas utilizando Ionic Capacitor.",
        "photo": "igor.jpg"
      }
    ]
  },
  {
    "id": 32,
    "title": "Parceria com NodeBR Online",
    "date": "29 de Outubro",
    "primaryColor": "#ba0582",
    "secondaryColor": "#d33479",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "NPM foi longe demais?",
        "speaker": "Filipe Silva",
        "description": "Líder técnico em Engenharia de Software na DellTech, louco por tecnologia, startups e produtos digitais.",
        "photo": "filipe.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Automatizando a publicação de pacotes com Semantic Release",
        "speaker": "Américo Neto",
        "description": "Desenvolvedor web no Itaú Unibanco, pai, santista e coorganizador da comunidade AngularSP.",
        "photo": "americo.jpg"
      }
    ]
  },
  {
    "id": 33,
    "title": "Parceria com  VueSP Online",
    "date": "26 de Novembro",
    "primaryColor": "#3CB371",
    "secondaryColor": "#104E8B",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "WebComponents: Por que utilizar e como construir usando Angular Elements",
        "speaker": "Karine Riquena Limp",
        "description": "Formada em Análise e Desenvolvimento de Sistemas. Iniciou a carreira como programadora backend .NET MVC. Trabalha na TOTVS. Atualmente, programando em ADVPL, .NET Core e Angular.",
        "photo": "karine.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Hello, Mr. Vue! Welcome V3",
        "speaker": "Heitor Ramon (vuejssp)",
        "description": "Engenheiro de Software com 15 anos de experiência, focado em arquitetura e frontend. Escritor do livro Vue.js 3 Cookbook publicado pela Packt. Lead Frontend Engineer na Kovi.",
        "photo": "heitor.jpg"
      }
    ]
  },
  {
    "id": 36,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de Fevereiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Testes Unitários com Jasmine",
        "speaker": "William Gundim",
        "description": "Desenvolvedor há mais de 10 anos. Atualmente, trabalhando com tecnologias web no Itaú Unibanco.",
        "photo": "williamg.JPG"
      },
      {
        "subtitle": "TALK #2",
        "title": "Micro front ends e Ng - Um Pesadelo virando sonho",
        "speaker": "Paulo Marinho",
        "description": "Desenvolvendo para web desde a epoca de BBS, tendo passado pelo por grandes empresas como iGSantander e Cultura como startups como ChefsClub e Plannera.",
        "photo": "tommy.JPG"
      }
    ]
  },
  {
    "id": 37,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de Março",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Simples e Fácil ",
        "speaker": "Guilherme Siquinelli",
        "description": "Desenvolvedor Front-end com mais de 14  anos de experiência, Tech Lead no Itaú. Está sempre avaliando tecnologias e tentando identificar que problemas podem ser resolvidos, misturado à aceitação da comunidade. Acredita que WebRTC tem potência disruptivo pra mudar nosso mercado como o conhecemos",
        "photo": "guilherme.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Vou ter que trabalhar com AngularJS. E agora?",
        "speaker": "Igor Debastiani",
        "description": "É desenvolvedor web front-end e já trabalhou com várias versões do Angular, tanto para web como para aplicações mobile híbridas. Atualmente dá manutenção em sistemas AngularJS e Angular 9.",
        "photo": "igor_debastiani.jpeg"
      }
    ]
  },
  {
    "id": 40,
    "title": "Evento online, no canal do Youtube",
    "date": "24 de Junho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Criando CRUD com PO-UI",
        "speaker": "Jhony Eduardo Senem",
        "description": "Jhony tem 25 anos, mora em Joinville SC, é graduado em Sistemas de Informação pelo Centro Universitário Católica - SC, Atualmente trabalhando na TOTVS como analista front-end, atuando no papel Product Owner do PO UI, possui experiências em Angular JS e Angular.",
        "photo": "Jhony_Senem.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "CSS Clamp",
        "speaker": "Thiago Piacentini",
        "description": "Formado em Análise e Desenvolvimento de Sistemas, atuando como Desenvolvedor Front-end no Itaú, sempre buscando aprender e aplicar responsividade e acessibilidade nas interface.",
        "photo": "Thiago_Piacentini.jpg"
      }
    ]
  },
  {
    "id": 41,
    "title": "Evento online, no canal do Youtube",
    "date": "29 de julho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Angular e Supabase - Uma alternativa ao Firebase",
        "speaker": "Kheron Machado",
        "description": "Professor da educação básica na rede pública estadual do Paraná, atua na formação de professores para uso de tecnologia em sala de aula. É desenvolvedor há mais de 12 anos. Tinha o perfil de Webmaster no Orkut e agora Front-end e Mobile no Linkedin.Formado em Processamento pela Fatec e Mestre em Computação pela UFPR, em 2019 escreveu o livro Angular e Firebase: Construindo uma aplicação integrada com a plataforma do Google pela Casa do Código.",
        "photo": "kheron.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Soft Skill - As habilidades secretas que não te ensinaram",
        "speaker": "Paolo Almeida",
        "description": "Caiçara. 32 anos. Trabalha com Produtos Digitais a mais de 10 anos. Atua como Engenheiro de Software no Itaú. Entusiasta em Open Source. Fã de Carreta Furacão. Finge que dança e surfa nas horas vagas.",
        "photo": "paolo_almeida.jpeg"
      }
    ]
  },
  {
    "id": 42,
    "title": "Evento online, no canal do Youtube",
    "date": "24 de agosto",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Dependency Injection com Angular",
        "speaker": "Guilherme Siquinelli",
        "description": "Engenheiro Front-end no Itaú Unibanco e 15 anos de experiência, estou sempre avaliando tecnologias na tentativa de identificar que problemas podem ser resolvidos, em conjunto à aceitação da comunidade. Em busca do máximo que a Web tem a oferecer!",
        "photo": "guilherme_siquinelli.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Teste unitário e a busca pela cobertura ideal",
        "speaker": "Vinicius Ledesma",
        "description": "Formado em Sistemas de Informação pelo Mackenzie e pós graduado em Engenharia Web/Mobile pelo Senac, trabalha com TI desde 2000. Trabalhou mais de 10 anos com sistema legado onde pode ajudar na evolução da linguagem para acompanhar os padrões de mercado das linguagens modernas. Hoje trabalha com uma linguagem moderna e sabe reconhecer o valor de cada ferramenta na hora de entregar um sistema com qualidade.",
        "photo": "vinicius_ledesma.jpeg"
      }
    ]
  },
  {
    "id": 43,
    "title": "Evento online, no canal do Youtube",
    "date": "28 de setembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Dependency Injection com Angular",
        "speaker": "Guilherme Siquinelli",
        "description": "Membro co-fundador da comunidade DevParaná. Engenheiro web sênior no Itaú Unibanco. Penso que a melhor forma de aprender é pensar que estamos apenas ensinando, e assim sigo degustando tecnologias e evoluindo junto a comunidade.",
        "photo": "guilherme_siquinelli.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Creepy JS",
        "speaker": "Bruno Macabeus",
        "description": "Sou Macabeus, trabalho ajudando a fazer compilador na OutSystems.Programo desde que conheci o Delphi e RPG Maker, passando também pelo bot para Ragnarok. Como 4fun, gosto de explorar coisas bizarras e desenvolver projetos lunáticos.",
        "photo": "macabeus.jpeg"
      }
    ]
  },
  {
    "id": 44,
    "title": "Evento online, no canal do Youtube",
    "date": "28 de outubro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "RxJs e sua filosofia de programação Funcional Reativa",
        "speaker": "Gabriel Grubba",
        "description": "Conheço a área do desenvolvimento desde meus 17 anos, já trabalhei com Delphi e PHP, atualmente trabalho com o Angular na Privacy,  sou  apaixonado pela área do desenvolvimento web, em especial pelo ambiente ambiente de cooperação que temos. Acredito na força do Open Source.",
        "photo": "gabriel_grubba.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Introdução de Typescript",
        "speaker": "Wiley Marques",
        "description": "Desenvolvedor web há quase 10 anos. Atualmente Arquiteto Líder responsável pela área de Arquitetura de Front-End no Santander Brasil. Envolvido com projetos em Angular, Flutter e nativo (Android e iOS).",
        "photo": "wiley_marques.jpeg"
      }
    ]
  },
  {
    "id": 45,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de novembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Aplicando boas práticas de acessibilidade na web",
        "speaker": "Mayara Lopes Cardoso",
        "description": "Engenheira Front-end no Itaú Unibanco, pós-graduada em Desenvolvimento Front-end e coorganizadora da comunidade AngularSP.",
        "photo": "mayaralopes.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Iniciando um projeto em Angular durante a pandemia",
        "speaker": "Wellington Torrejais da Silva",
        "description": "Formado em Análise e Desenvolvimento de Sistemas, cursando Pós em Banco de Dados.Anteriormente, Administrador de Redes. Hoje trabalhando com Ruby on Rails e iniciando com Angular.Moro em Maringá no Paraná e transformei minha casa numa República, tenho 2 gatos e 2 irmãos que moram comigo.",
        "photo": "wtorrejais.jpg"
      }
    ]
  },
  {
    "id": 46,
    "title": "Evento online, no canal do Youtube",
    "date": "21 de dezembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Introdução a testes Untiários com Angular",
        "speaker": "Ivonaldo Junior da Silva Soares",
        "description": "Desenvolvedor Front-End há 6 anos na área com experiência em empresas de diversas áreas, nascido e criado no interior do RJ, mas atualmente morando em são paulo, apaixonado por comunidades de desenvolvimento de softwares, também gosto de beber uma cerveja e fazer um churrasco com os amigos.",
        "photo": "Ivonaldo.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Quick wins pra sua carreira decolar 🚀",
        "speaker": "Paolo Almeida",
        "description": "Caiçara, 32 anos, TechLead e Dev Advocate no @itau, co-organizador no @angularSP. Fazendo coisas pra internet há mais de 12 anos, entusiasta em open source e comunidades, nas horas vagas se arrisca na dança e esportes radicais, também é fã da carreta furacão.",
        "photo": "paolo_almeida.jpeg"
      }
    ]
  },
  {
    "id": 47,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de janeiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Criptografia e Autenticação biométrica nativa no navegador",
        "speaker": "William Grasel",
        "description": "Desenvolvedor Web apaixonado com mais de 18 anos de experiência na área, Google Developer Expert, Microsoft MVP, especializado em FrontEnd com Single Page Apps e Progressive Web Apps, contribuidor open source, consultor, organizador de comunidades, palestrante, amante de JavaScript / TypeScript, performance, segurança e programação funcional, sempre fascinado por novas tecnologias e de olho nesse tal de Web Assembly.",
        "photo": "william_grasel.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Programação Orientada a Interfaces no Angular",
        "speaker": "Andrew Rosário",
        "description": "Pós-Graduado em Desenvolvimento Web e Mobile. Atua como Desenvolvedor Front-End na Shift e produz conteúdos para a comunidade a partir de vídeos e artigos.",
        "photo": "andrew_rosario.jpg"
      }
    ]
  },
  {
    "id": 48,
    "title": "Evento online, no canal do Youtube",
    "date": "22 de fevereiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Introdução ao AWS Amplify",
        "speaker": "Ricardo Mello",
        "description": "Engenheiro de Software, AWS Community Builder, amante de JavaScript e TypeScript, ciclista e viciado em música, escreve artigos e é organizador do Angular Rio.",
        "photo": "ricardo_mello.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Acessibilidade no Angular",
        "speaker": "Geovana Silva Ribeiro",
        "description": "Pós-Graduado em Desenvolvimento Web e Mobile. Atua como Desenvolvedor Front-End na Shift e produz conteúdos para a comunidade a partir de vídeos e artigos.",
        "photo": "geovana_silva.png"
      }
    ]
  },
  {
    "id": 49,
    "title": "Evento online, no canal do Youtube",
    "date": "31 de março",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Depois do sênior, para onde eu posso ir?",
        "speaker": "Alvaro Camillo Neto",
        "description": "Alvaro é um engenheiro de software do Brasil. Ele trabalha na industria de tecnologia há mais de 15 anos dedicados ao desenvolvimento de soluções empresariais e financeiras. Alvaro é um entusiasta da tecnologia e vê no compartilhamento do conhecimento uma oportunidade de ajudar a comunidade que tanto o ajudou e a melhor forma de aprendizado.",
        "photo": "alvaro.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Governança de Micro FrontEnds",
        "speaker": "William Grasel",
        "description": "Desenvolvedor Web apaixonado com mais de 18 anos de experiência na área, Google Developer Expert, Microsoft MVP, especializado em FrontEnd com Single Page Apps e Progressive Web Apps, contribuidor open source, consultor, organizador de comunidades, palestrante, amante de JavaScript / TypeScript, performance, segurança e programação funcional, sempre fascinado por novas tecnologias e de olho nesse tal de Web Assembly.",
        "photo": "william_grasel.jpg"
      }
    ]
  },
  {
    "id": 50,
    "title": "Evento online, no canal do Youtube",
    "date": "19 de abril",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Programação reativa com Angular e RxJS",
        "speaker": "Pedro Cunha",
        "description": "Entrei no mundo da tecnologia devido a pandemia, e foi uma das melhores coisas que já me aconteceu. Apaixonado por Angular desde o primeiro momento, venho dia após dia desbravando as maravilhas do framework e de todo universo de TI, buscando me tornar um DEV e um ser humano mais completo, podendo contribuir cada vez mais por um mundo melhor!",
        "photo": "pedro_cunha.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Minimal API com .NEt 6",
        "speaker": "Robson Gomes Junior ",
        "description": "Iniciei minha carreira na universidade como estagiário de TI em 2014 e logo fui convidado a integrar  o corpo técnico do setor de TI, com o tempo fui notado pela capacidade de tomar decisões, de liderar e por meio das minhas capacitações tive bons resultados e fui promovido a cargos de gestão, principalmente de desenvolvimento e sistemas, me levando ao alto nível de gestão de TI do Governo do Estado do Rio de Janeiro, mas em 2020 percebi que o que eu sempre quis fazer era desenvolver. Pedi exoneração do meu cargo público em outubro deste mesmo ano e em abril de 2021 iniciei minha carreira como desenvolvedor junior backend na Totvs. Escolhi descer alguns degraus para tomar impulso e fazer realmente só o que gosto.",
        "photo": "robson_gomes_junior.jpg"
      }
    ]
  },
  {
    "id": 51,
    "title": "Evento online, no canal do Youtube",
    "date": "24 de maio",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Perspectivas de acessibilidade no século XXI: O recurso além da adaptação",
        "speaker": "Leandro Alcolumbre",
        "description": "Leandro Alcolumbre é bacharel em Direito e entusiasta de tecnologia, concentrando seus estudos nas temáticas de acessibilidade, educação inclusiva, bem como o papel das TICs na autonomia e inclusão de pessoas com deficiência.",
        "photo": "leandro_alcolumbre.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Testes no Angular com Testing Library",
        "speaker": "Andrew Rosário",
        "description": "Pós-Graduado em Desenvolvimento Web e Mobile. É apaixonado por Angular e Front-end. Produz conteúdos para a comunidade a partir de vídeos e artigos.",
        "photo": "andrew_rosario.jpg"
      }
    ]
  },
  {
    "id": 52,
    "title": "Evento online, no canal do Youtube",
    "date": "14 de Junho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "O poder da programação reativa com RxJs",
        "speaker": "Fábio Miranda",
        "description": "Carioca, Frontend Sênior no Itaú, apaixonado pelo Angular e um dos coorganizadores do Meetup Angular Rio. Quando cheguei no Angular, era tudo mato(2017).",
        "photo": "fabio_miranda.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Torturando o Angular: uma introdução ao roteamento e um pouco de RxJs",
        "speaker": "Gabriel Grubba",
        "description": "Perdidamente apaixonado por open source, o maluco que faz as coisas em typelevel no TypeScript. Melhorando o mundo através do Software. Atualmente trabalhando com Angular na Privacy",
        "photo": "gabriel_grubba.jpg"
      }
    ]
  },
  {
    "id": 53,
    "title": "Evento online, no canal do Youtube",
    "date": "26 de julho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "O poder da programação reativa com RxJs",
        "speaker": "Fábio Miranda",
        "description": "Carioca, Frontend Sênior no Itaú, apaixonado pelo Angular e um dos coorganizadores do Meetup Angular Rio. Quando cheguei no Angular, era tudo mato(2017).",
        "photo": "fabio_miranda.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Documentação: Aprenda como escrever e estruturar melhor",
        "speaker": "Vinicius Lagêdo",
        "description": "Aproximadamente 10 anos de experiência em front-end e ainda descobrindo novas soluções para os mesmos problemas",
        "photo": "vinicius_lagedo.png"
      }
    ]
  },
  {
    "id": 54,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de outubro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "API REST em Node.js: Boas práticas em produção",
        "speaker": "Rodrigo Kamada",
        "description": "Nesta palestra serão apresentados os conceitos, fundamentos e padrões de uma API REST e as boas práticas de implementação usadas em produção em uma aplicação Node.js com TypeScript, Express e MongoDB.",
        "photo": "Rodrigo_Kamada.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Desmistificando o Typescript",
        "speaker": "Joao Paulo Avila",
        "description": "Palestra introdutória ao typescript, mostrando algumas features e como elas funcionam, para poder auxiliar quem está iniciando com o TS.",
        "photo": "Joao_Paulo_Avila.JPG"
      }
    ]
  },
  {
    "id": 55,
    "title": "Evento presencial, no Itaú",
    "date": "23 de novembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "O segredo dos Times de Engenharia Escaláveis: Criando uma cultura de Documentação",
        "speaker": "Paolo Almeida",
        "description": "Nesta talk, abordo numa visão 360, como construir uma cultura de colaboração e documentação pode tornar times de Engenharia muito mais escaláveis. Trazendo as principais dores e desafios dentro desta jornada.",
        "photo": "paolo_almeida.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Desenvolvendo aplicativos nativos usando Angular e NativeScript",
        "speaker": "Eduardo Speroni",
        "description": "NativeScript permite que você tenha acesso direto a APIs nativas (Java/Kotlin/Objective-C/Swift) diretamente a partir de JavaScript. Esta palestra aborda como isso é feito e como é possível utilizar Angular para desenvolver uma aplicação nativa utilizando fundamentos web, sem utilizar uma WebView.",
        "photo": "eduardo_speroni.jpg"
      }
    ]
  },
  {
    "id": 56,
    "title": "Evento online, no canal do Youtube",
    "date": "15 de dezembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Performance e gestão de Estado em Aplicações Angular",
        "speaker": "Lucas Sacramoni Peixoto Fernandes",
        "description": "A Palestra tem como objetivo apresentar técnicas de performance em aplicações com Angular e também as vantagens de se utilizar a ferramenta NgRx para gestão de estado, com foco na performance.",
        "photo": "lucas_peixoto.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Construindo bibliotecas Typescript em um workspace NX",
        "speaker": "Mayara Cardoso",
        "description": "O NX traz uma série de recursos que facilitam o desenvolvimento de softwares e um deles é a possiblidade de construir aplicações e bibliotecas Typescript, sem dependência de nenhum framework específico. Nesta palestra, você aprenderá a criar e configurar uma biblioteca Typescript num workspace NX, prepará-la para publicação e utilizá-la em diferentes projetos. Discutiremos um pouco também sobre a importância de soluções agnósticas em determinados contextos e como o NX pode nos auxiliar nesse processo.",
        "photo": "mayaralopes.jpeg"
      }
    ]
  },
  {
    "id": 57,
    "title": "Evento online, no canal do Youtube",
    "date": "17 de janeiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "SOLID, uma história",
        "speaker": "Alexandre Aquiles",
        "description": "Será que um livro técnico pode contar uma história? Sim! Nessa palestra, Alexandre Aquiles contará sobre a transformação de um código ruim em um código mais fácil de entender e modificar. Cada um dos princípios (ou dicas) SOLID servirão como guia para uma (suposta) melhoria. Ou será que dá pra piorar?",
        "photo": "alexandre_aquiles.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Composição de Formulários no Angular",
        "speaker": "Andrew Rosário",
        "description": "Desenvolver formulários complexos no frontend é um grande desafio. Precisamos lidar com muitos cenários como validações, lógicas de interação e reuso. Nesta talk apresentarei algumas técnicas para compor formulários utilizando o Angular Reactive Forms, garantindo assim mais flexibilidade e coesão para seu código.",
        "photo": "andrew_rosario.jpg"
      }
    ]
  },
  {
    "id": 58,
    "title": "Evento online, no canal do Youtube",
    "date": "06 de março",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "O poder das Diretivas no Angular - Usando diretivas nativas e criando diretivas personalizadas",
        "speaker": "João Vitor Miranda",
        "description": "O Angular possui várias diretivas que facilitam muito o desenvolvimento ágil e a manutenção do nosso código. Nessa palestra, vou falar sobre as diretivas nativas do Angular mais importantes e úteis e também vou ensinar como podemos criar diretivas customizadas que atendem necessidades específicas da nossa aplicação.",
        "photo": "joao_vitor_miranda.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Mercado de trabalho, demissão em massa e Layoffs: Saiba como Acelerar sua Recolocação no Mercado de Tecnologia",
        "speaker": "Paolo Almeida",
        "description": "O mercado de trabalho está em constantes mudanças, estamos vendo ondas de demissão em massa, layoffs e muitas pessoas impactadas. Nesta talk, eu trago um passo a passo pra ajudar você a acelerar sua recolocação no mercado de tecnologia, com tarefas práticas pra já aplicar e testar!",
        "photo": "paolo_almeida.jpeg"
      }
    ]
  },
  {
    "id": 59,
    "title": "Evento online, no canal do Youtube",
    "date": "13 de abril",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Processamento de streamings com NodeJS",
        "speaker": "Fabio Molliet",
        "description": "Como podemos desenvolver aplicação de alta performance para processar, manipular, converter dados utilizando streaming em NodeJS.",
        "photo": "fabio_molliet.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Arquitetura REST para front-ends",
        "speaker": "Eron Alves da Silva",
        "description": "O que de fato é a arquitetura REST? De fato, por vezes podemos nos deparar com serviços que seguem contratos estranhos, e ficamos em dúvidas se aquilo está correto mesmo. O objetivo desta talk é desmistificar a modelagem desses serviços e apresentar as principais convenções em torno disso.",
        "photo": "eron.jpg"
      }
    ]
  },
  {
    "id": 61,
    "title": "Evento online, no canal do Youtube",
    "date": "22 de junho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Pre-Sales: Quanto vale o seu código?",
        "speaker": "Alexandre Barrionuevo",
        "description": "Alexandre é Arquiteto de Soluções no Banco Santander, com ampla experiência em tecnologia, negócios sustentáveis, liderança e formação de profissionais de TI.",
        "photo": "alexandre_barrionuevo.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Carreira sem fronteiras : trabalhando para o exterior",
        "speaker": "Francisco Cardoso",
        "description": "Especialista DevOps focado em construir, gerenciar e otimizar plataformas cloud. Atuando em projetos desafiadores para uma empresa Irlandesa, com clientes e colegas de diversas partes do mundo, codando IaC, CI/CD pipelines, specs para clusters, habilitando e melhorando observabilidade.",
        "photo": "fran_cardoso.jpg"
      }
    ]
  },
  {
    "id": 62,
    "title": "Evento online, no canal do Youtube",
    "date": "25 de julho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Introdução ao Flutter",
        "speaker": "Jéssica Pereira",
        "description": "Graduada em Análise e Desenvolvimento de Sistemas, desenvolvedora há 8 anos e se especializando em desenvolvimento mobile. Sou entusiasta do Flutter e acredito no seu poder de criar experiências incríveis e consistentes em diferentes plataformas. ",
        "photo": "jessica_pereira.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Princípios SOLID para Arquitetura de Aplicações Web",
        "speaker": "Guilherme Siquinelli ",
        "description": "Arquiteto Front-end, Professor, Consultor, Palestrante, noob no desenvolvimento de Jogos 3D para web e curioso pelo universo.",
        "photo": "guilherme_siquinelli.jpg"
      }
    ]
  },
  {
    "id": 63,
    "title": "Evento online, no canal do Youtube",
    "date": "6 de setembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Nx: escalando seu frontend com monorepo",
        "speaker": "Andrew Rosário",
        "description": "Escalar um ecossistema frontend moderno envolve governança, custos, processos, confiabilidade de entrega e performance em alto nível. Cada vez mais o tema de monorepositórios é tratado para alcançar estes objetivos. Nesta talk irei falar sobre o Nx, que é um grande destaque quando o assunto é gerenciamento de monorepos, principalmente se tratando deste universo complexo que é o frontend.",
        "photo": "andrew_rosario.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Introdução ao Angular Signals",
        "speaker": "Américo Neto",
        "description": "Uma abordagem para facilitar a comunicação entre componentes em aplicações Angular. Serão explorados conceitos, benefícios e exemplos de como utilizar esse padrão para melhorar a interação entre partes distintas da aplicação.",
        "photo": "americo.jpg"
      }
    ]
  },
  {
    "id": 66,
    "title": "Evento online, no canal do Youtube",
    "date": "13 de dezembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Construindo o Futuro do JavaScript e do Angular: Uma Exploração das Ferramentas de Build (Rollup, ESBuild, Webpack e Vite)",
        "speaker": "Daniel Bertolini",
        "description": "Descubra como cada uma dessas ferramentas aborda o processo de construção, otimização e empacotamento de código Angular, e como elas podem transformar sua experiência de desenvolvimento e entrega de aplicações Angular",
        "photo": "daniel_bertolini.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Copilot World - Do GPT aos Copilots",
        "speaker": "Pablo Lopes",
        "description": "Copilot isso, Copilot aquilo. Mas como realmente chegamos aos Copilots? Nessa palestra Pablo Lopes vai explicar de antes do GPT até os momentos atuais os copilotos. Que agora, vivemos um período de mudanças fortes e como se adaptar a eles utilizando em trabalho.",
        "photo": "pablo_lopes.jpeg"
      }
    ]
  },
  {
    "id": 67,
    "title": "Evento online, no canal do Youtube",
    "date": "23 de janeiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Deixe o jest trabalhar por você",
        "speaker": "Waldir Neto",
        "description": "o Jest é seu amigo e quer te ajudar! deixe ele facilitar sua vida e ganhe tempo fazendo seus testes.",
        "photo": "waldir_neto.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Angular query: O futuro do gerenciamento de estado assíncrono",
        "speaker": "Matheus Rian de Souza Silva",
        "description": "TanStack Query, biblioteca versátil compatível com diversos frameworks, destaca-se por sua abordagem declarativa e automática no gerenciamento de estado assíncrono, lidando com cache, atualizações e dados obsoletos sem configurações adicionais.",
        "photo": "matheus_rian.png"
      }
    ]
  },
  {
    "id": 68,
    "title": "Microsoft Reactor e Online",
    "date": "27 de fevereiro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Angular Signals: Reatividade Simples e Prática",
        "speaker": "William Grasel",
        "description": "Angular sempre foi um framework reativo, mas para muitos desenvolvedores o RxJS pode ser difícil de absorver e dominar, tornando uma solução demasiadamente complexa para problemas comuns do dia a dia. Signals vem para ser a nova primitiva reativa do framework, simples, prática e fácil, além de uma perfeita integração com RxJS que continua sendo importante para os casos reativos mais complexos! Vamos entender como os Signals funcionam, como eles se integram no ecossistema atual, o que você vai precisar aprender, e qual o futuro do framework com essa novidade!",
        "photo": "william_grasel.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Angular Update: Guia Prático para Atualizações Sem Estresse",
        "speaker": "Andrew Rosário",
        "description": "Esta palestra oferece conselhos úteis e passos claros para atualizar sua aplicação Angular de versões mais antigas para as mais recentes, sem estresse. Vamos explorar ferramentas úteis, pontos de atenção e estratégias para garantir uma transição eficiente para as novas versões do Angular.",
        "photo": "andrew_rosario.jpg"
      }
    ]
  },
  {
    "id": 69,
    "title": "Evento online, no canal do Youtube",
    "date": "26 de março",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Conecta Brasil - O que o http3 pode nos ajudar.",
        "speaker": "Douglas Guerra",
        "description": "Introdução do HTTP3 e breve explicação de versões e como utilizá-lo ",
        "photo": "douglas_guerra.jpg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Angular Moderno - O que tá acontecendo?",
        "speaker": "Fabio Miranda",
        "description": "Nessa talk irei falar do histórico de mudanças do Angular, qual caminho o framework está tomando e o que podemos esperar do futuro.",
        "photo": "fabio_miranda.jpeg"
      }
    ]
  },
  {
    "id": 70,
    "title": "Evento online, no canal do Youtube",
    "date": "30 de julho",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Cypress - escrevendo testes e2e no Front End",
        "speaker": "Natália Luiza",
        "description": "",
        "photo": "natalia_luiza.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Angular Moderno - O que tá acontecendo?",
        "speaker": "Fabio Miranda",
        "description": "Nessa talk irei falar do histórico de mudanças do Angular, qual caminho o framework está tomando e o que podemos esperar do futuro.",
        "photo": "fabio_miranda.jpeg"
      }
    ]
  },
  {
    "id": 72,
    "title": "AngularSP - Edição TOTVS",
    "date": "27 de agosto",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Desenvolvimento ágil com PO UI e Angular 18",
        "speaker": "Aline Lariguet e Carlos Simões",
        "description": "Nesta palestra, desenvolveremos um CRUD (Create, Read, Update e Delete) utilizando o Angular 18 e PO UI, aproveitando templates prontos fornecidos por nossa biblioteca de componentes. Abordaremos como customizar o tema da aplicação por meio de serviços, além de customizar as propriedades dos componentes para atender às necessidades específicas do projeto.",
        "photo": "Aline_Carlos.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "Gerenciamento de Conexões Massivas e Pooling no PostgreSQL Cloud-Native",
        "speaker": "Ronaldo Andrade Silva",
        "description": "A palestra aborda como otimizar a gestão de milhares de conexões simultâneas ao PostgreSQL em ambientes cloud-native, focando em técnicas de pooling de conexões para melhorar a eficiência e o desempenho do banco de dados. Ferramentas como PgBouncer e PgPool-II são discutidas para reduzir a sobrecarga no servidor, além do uso do pgbench para testar diferentes configurações e garantir a melhor performance. A abordagem visa assegurar que o PostgreSQL opere de forma eficiente e escalável em ambientes de nuvem, mesmo sob cargas elevadas.",
        "photo": "Ronaldo_Andrade.jpeg"
      }
    ]
  },
  {
    "id": 73,
    "title": "AngularSP - Online",
    "date": "25 de setembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Carreira Tech no Universo da Programação",
        "speaker": "Damarys Africa",
        "description": "Vamos falar sobre a trilha técnica do universo da programação discutindo os modelos tradicionais de progressão hierárquica e de estrutura de carreira, entender um pouco dos níveis de maturidade de desenvolvimento, e o que fazem os devs junior para além do sênior e saber como transitar no mercado de engenharia de software.",
        "photo": "damarys_africa.jpeg"
      },
      {
        "subtitle": "TALK #2",
        "title": "O que Está Matando Seu Código Java?",
        "speaker": "Leandro Marques",
        "description": "Descubra os erros comuns que prejudicam a performance do seu código Java. Aprenda a evitar armadilhas que causam lentidão, alto consumo de memória e problemas de escalabilidade. Melhore suas habilidades de desenvolvimento Java com boas práticas que tornam suas aplicações mais rápidas, eficientes e prontas para crescer.",
        "photo": "leandro_marques.jpeg"
      }
    ]
  },
  {
    "id": 74,
    "title": "AngularSP - Online",
    "date": "07 de novembro",
    "primaryColor": "darkOrange",
    "secondaryColor": "gold",
    "talks": [
      {
        "subtitle": "TALK #1",
        "title": "Server Side rendering (SSR) no Angular",
        "speaker": "Lucas Peixoto",
        "description": "Angular 17 com SSR oferece vantagens como melhor performance, SEO e experiência do usuário, ao renderizar o conteúdo inicial via servidor. A apresentação explora o funcionamento do SSR e como aplicá-lo em projetos Angular para otimizar carregamento e visibilidade online.",
        "photo": "lucas_peixoto.png"
      },
      {
        "subtitle": "TALK #2",
        "title": "Segurança por Design: Protegendo Sistemas desde a Primeira Linha de Código",
        "speaker": "Renan Ferraro",
        "description": "Em um mundo cada vez mais conectado e com crescentes ameaças cibernéticas, desenvolver software com segurança em mente desde o início é fundamental. Nesta palestra, vamos explorar os princípios de “Segurança por Design”, abordando como arquitetar e codificar sistemas robustos e protegidos contra vulnerabilidades comuns.",
        "photo": "renan_ferraro.jpeg"
      }
    ]
  }
]
